api/app/controllers/api/v1/airlines_controller.rb

      def index
        airlines = Airline.all
---
SELECT "airlines".* FROM "airlines"

        def set_airline
          @airline = Airline.find_by(slug: params[:slug])
---
SELECT "airlines".* FROM "airlines" WHERE "airlines"."slug" = ? LIMIT ?  [["slug", "united-airlines"], ["LIMIT", 1]]