api/app/controllers/api/v1/reviews_controller.rb

INSERT INTO "reviews" ("title", "description", "score", "airline_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Greate Experience!"], ["description", "had a great time!"], ["score", 4], ["airline_id", 7], ["created_at", "2021-05-26 16:17:10.889444"], ["updated_at", "2021-05-26 16:17:10.889444"]]
---
      def create
        review = airline.reviews.new(review_params)
        if review.save

SELECT "airlines".* FROM "airlines" WHERE "airlines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        def airline
          @airline ||= Airline.find(params[:airline_id])